Catalogs/упАдреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упАдреса</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРаботВТочке</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУбытияИзТочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГеографическаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеОтклонениеУбытияИзТочки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВремяУбытияИзТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормализованноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПомещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКоординаты</Name>
					<Comment>Представление широты и долготы в формате "34.451234;45.345666;"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упАдреса/Forms/ФормаЗагрузки/Ext/Form/Module.bsl
#Область ОбластьТекущихПеременных

// Флаг подтверждения, используется при не модальном режиме.
&НаКлиенте
Перем ПодтверждениеЗакрытияФормы;

#КонецОбласти 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТабличныйДокумент = Справочники.упАдреса.ПолучитьМакет("МакетЗагрузки");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Если ПодтверждениеЗакрытияФормы <> Истина Тогда
			
			Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормыЗавершение", ЭтотОбъект);
			Отказ = Истина;
			
			Текст = НСтр("ru = 'При закрытии несохраненные данные будут потеряны. Сохранить?'");
			ПоказатьВопрос(Оповещение,Текст,РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Да,"Сохранить изменения");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаАдресовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	текСтрока = Элементы.ТаблицаАдресов.ТекущиеДанные;
	Если ЗначениеЗаполнено(текСтрока.АдресДубль) И ТипЗнч(текСтрока.АдресДубль) = Тип("СправочникСсылка.упАдреса") Тогда 
		ПоказатьЗначение(, текСтрока.АдресДубль);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАдресовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура СнятьПометкиСоВсехАдресов(Команда)
	
	Для Каждого текСтрока Из ТаблицаАдресов Цикл 
		текСтрока.Пометка = Ложь;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ПроверитьЗаполнение() Тогда 
		ЗагрузитьСервер();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсеАдреса(Команда)
	
	Для Каждого текСтрока Из ТаблицаАдресов Цикл 
		текСтрока.Пометка = Истина;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура РазобратьАдреса(Команда)
	
	ТаблицаАдресов.Очистить();
	
	сткПоискАдрес      = Новый Структура("АдресСтрокой");
	сткПоискКоординаты = Новый Структура("Долгота, Широта");
	Для Сч = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл 
		текЯчейка  = ТабличныйДокумент.Область(Сч, 1, Сч, 1);
		текШирота  = СокрП(ТабличныйДокумент.Область(Сч, 2, Сч, 2).Текст);
		текДолгота = СокрП(ТабличныйДокумент.Область(Сч, 3, Сч, 3).Текст);
		
		АдресСтрокой = Лев(СокрЛП(текЯчейка.Текст), 150);
		Если ЗначениеЗаполнено(АдресСтрокой) Тогда 
			АдресДубль          = "";
			Пометка             = Истина;
			СовпалоНаименование = Ложь;
			СовпалиКоординаты   = Ложь;
			Координаты          = Неопределено;
			
			сткПоискАдрес.АдресСтрокой = АдресСтрокой;
			мсвСтрок = ТаблицаАдресов.НайтиСтроки(сткПоискАдрес);
			Если мсвСтрок.Количество() Тогда 
				Если ЗначениеЗаполнено(мсвСтрок[0].АдресДубль) Тогда 
					АдресДубль = мсвСтрок[0].АдресДубль;
				Иначе	
					АдресДубль = мсвСтрок[0].АдресСтрокой;
				КонецЕсли;	
				Пометка             = Ложь;
				СовпалоНаименование = Истина;
				
				Координаты = Новый Структура("ПолноеПредставление, Долгота, Широта", мсвСтрок[0].ПолноеПредставление, мсвСтрок[0].Долгота, мсвСтрок[0].Широта);
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(текШирота) И ЗначениеЗаполнено(текДолгота) Тогда
				Координаты = Новый Структура("ПолноеПредставление, Долгота, Широта", АдресСтрокой, текДолгота, текШирота);
			КонецЕсли; 
			
			Если Координаты = Неопределено Тогда 
				Координаты = упГеокодированиеКлиентСервер.НайтиКоординатыАдреса(АдресСтрокой);
			КонецЕсли;
			
			Если Координаты <> Неопределено И Не СовпалоНаименование И (Координаты.Широта <> 0 ИЛИ Координаты.Долгота <> 0) Тогда 
				сткПоискКоординаты.Долгота = Координаты.Долгота;
				сткПоискКоординаты.Широта  = Координаты.Широта;
				мсвСтрок = ТаблицаАдресов.НайтиСтроки(сткПоискКоординаты);
				Если мсвСтрок.Количество() Тогда 
					Если ЗначениеЗаполнено(мсвСтрок[0].АдресДубль) Тогда 
						АдресДубль = мсвСтрок[0].АдресДубль;
					Иначе	
						АдресДубль = мсвСтрок[0].АдресСтрокой;
					КонецЕсли;	
					Пометка             = Ложь;
					СовпалиКоординаты   = Истина;
				КонецЕсли;	
			КонецЕсли;	
			
			НоваяСтрока = ТаблицаАдресов.Добавить();
			НоваяСтрока.Пометка             = Пометка;
			НоваяСтрока.АдресСтрокой        = АдресСтрокой;
			НоваяСтрока.АдресДубль          = АдресДубль;
			НоваяСтрока.СовпалоНаименование = СовпалоНаименование;
			НоваяСтрока.СовпалиКоординаты   = СовпалиКоординаты;
			НоваяСтрока.Комментарий         = Комментарий;
			
			Если Координаты <> Неопределено Тогда 
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Координаты);
			КонецЕсли;
		КонецЕсли;
		
		Состояние(НСтр("ru = 'Разбор адресов'"), Цел(Сч * 100/ ТабличныйДокумент.ВысотаТаблицы), НСтр("ru = 'Поиск координат и дублирующихся аресов'"), БиблиотекаКартинок.Информация32);
	КонецЦикла;	
	
	РазобратьАдресаНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Общий обработчик подтверждения закрытия.
//
// Параметры:
//  РезультатВопроса  - КодВозвратаДиалога - Результат ответа.
//  ДополнительныеПараметры  - Структура - Параметры.
//
Процедура ЗакрытиеФормыЗавершение(Знач РезультатВопроса, Знач ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗагрузитьСервер();		
		// Закрываем без дополнительных вопросов.
		ПодтверждениеЗакрытияФормы = Истина;
		Закрыть();
		
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		// Закрываем без дополнительных вопросов.
		ПодтверждениеЗакрытияФормы = Истина;
		Закрыть();
	Иначе 
		ПодтверждениеЗакрытияФормы = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ЗакрытиеФормыЗавершение()

&НаСервере
Процедура ЗагрузитьСервер()
	
	Для Каждого текСтрока Из ТаблицаАдресов Цикл 
		Если текСтрока.Пометка Тогда
			НовыйОбъект = Справочники.упАдреса.СоздатьЭлемент();
			НовыйОбъект.Наименование        = текСтрока.АдресСтрокой;
			НовыйОбъект.ВидАдреса           = ВидАдреса;
			НовыйОбъект.ПолноеПредставление = текСтрока.ПолноеПредставление;
			НовыйОбъект.ПолноеНаименование  = текСтрока.ПолноеПредставление;
			НовыйОбъект.Долгота             = текСтрока.Долгота;
			НовыйОбъект.Широта              = текСтрока.Широта;
			НовыйОбъект.Комментарий         = текСтрока.Комментарий;
			
			Попытка
				НовыйОбъект.Записать();
				текСтрока.Пометка = Ложь;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось записать адрес ""%1"" : %2'"), текСтрока.АдресСтрокой, КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
			КонецПопытки;	
		КонецЕсли;	
	КонецЦикла;	
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура РазобратьАдресаНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(втАдресаСтрокой.АдресСтрокой КАК СТРОКА(150)) КАК АдресСтрокой,
	|	втАдресаСтрокой.Долгота,
	|	втАдресаСтрокой.Широта
	|ПОМЕСТИТЬ втАдреса
	|ИЗ
	|	&втАдресаСтрокой КАК втАдресаСтрокой
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втАдреса.АдресСтрокой КАК АдресСтрокой,
	|	упАдреса.Ссылка КАК АдресДубльНаименование,
	|	упАдресаКоординаты.Ссылка КАК АдресДубльКоординаты,
	|	ВЫБОР
	|		КОГДА упАдреса.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СовпалоНаименование,
	|	ВЫБОР
	|		КОГДА упАдресаКоординаты.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СовпалиКоординаты
	|ИЗ
	|	втАдреса КАК втАдреса
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упАдреса КАК упАдреса
	|		ПО втАдреса.АдресСтрокой = упАдреса.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упАдреса КАК упАдресаКоординаты
	|		ПО втАдреса.Долгота = упАдресаКоординаты.Долгота
	|			И втАдреса.Широта = упАдресаКоординаты.Широта
	|ГДЕ
	|	(НЕ упАдреса.Ссылка ЕСТЬ NULL 
	|			ИЛИ НЕ упАдресаКоординаты.Ссылка ЕСТЬ NULL )
	|
	|УПОРЯДОЧИТЬ ПО
	|	АдресСтрокой,
	|	СовпалоНаименование УБЫВ,
	|	СовпалиКоординаты УБЫВ";
	Запрос.УстановитьПараметр("втАдресаСтрокой", ТаблицаАдресов.Выгрузить());
	
	сткПоиска = Новый Структура("АдресСтрокой");
	
	тбзДубли = Запрос.Выполнить().Выгрузить();
	Для Каждого текСтрока Из тбзДубли Цикл 
		текСтрока.АдресСтрокой = СокрЛП(текСтрока.АдресСтрокой);
	КонецЦикла;
	
	Для Каждого текСтрока Из ТаблицаАдресов Цикл
		сткПоиска.АдресСтрокой = текСтрока.АдресСтрокой;
		
		мсвСтрок = тбзДубли.НайтиСтроки(сткПоиска);
		Если мсвСтрок.Количество() Тогда 
			Если мсвСтрок[0].СовпалоНаименование Тогда 
				текСтрока.АдресДубль          = мсвСтрок[0].АдресДубльНаименование;
				текСтрока.СовпалоНаименование = Истина;
				текСтрока.Пометка             = Ложь;
			ИначеЕсли мсвСтрок[0].СовпалиКоординаты И Не текСтрока.СовпалоНаименование Тогда 
				текСтрока.АдресДубль          = мсвСтрок[0].АдресДубльКоординаты;
				текСтрока.СовпалиКоординаты   = Истина;
				текСтрока.Пометка             = Ложь;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти
